'use strict';
// Библиотеки всегда помещаются перед главным скриптом
// Библиотеки можно подключать через CDN - сайты где доступен бесперебойный доступ к библиотекам

// axios - позволяет позволяет работать с сервером , получать и постить элементы и др. действия
// в ней изначально есть много возможностей, которые каждый раз бы пришлось писать вручную

// например проверки на ошибки уже работают автоматически
// конвертация в json тоже авто (при необходимости)
// когда некогда занимать настройкой функций по получению либо отправки данных
// подключается просто такая библиотека которая делает просто за нас


// самое главное правило при использовании готового ресурса
// всегда читать документацию библиотеки
